In [3]:
import pandas as pd
df = pd.read_csv("./tested.csv")
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,0,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [5]:
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'], axis='columns',inplace=True)
df.head()

   Survived  Pclass     Sex   Age     Fare
0         0       3    male  34.5   7.8292
1         1       3  female  47.0   7.0000
2         0       2    male  62.0   9.6875
3         0       3    male  27.0   8.6625
4         1       3  female  22.0  12.2875

In [6]:
target=df.Survived
inputs=df.drop('Survived',axis='columns')

In [8]:
dummies = pd.get_dummies(inputs.Sex)
inputs.head(3)

   Pclass     Sex   Age    Fare
0       3    male  34.5  7.8292
1       3  female  47.0  7.0000
2       2    male  62.0  9.6875

In [9]:
inputs = pd.concat([inputs,dummies],axis='columns')
inputs.head(3)

   Pclass     Sex   Age    Fare  female  male
0       3    male  34.5  7.8292       0     1
1       3  female  47.0  7.0000       1     0
2       2    male  62.0  9.6875       0     1

In [10]:
inputs.drop('Sex',axis='columns',inplace=True)
inputs.head(3)

   Pclass   Age    Fare  female  male
0       3  34.5  7.8292       0     1
1       3  47.0  7.0000       1     0
2       2  62.0  9.6875       0     1

In [11]:
inputs.columns[inputs.isna().any()]

Index(['Age', 'Fare'], dtype='object')

In [12]:
inputs.Age[:10]

0    34.5
1    47.0
2    62.0
3    27.0
4    22.0
5    14.0
6    30.0
7    26.0
8    18.0
9    21.0
Name: Age, dtype: float64

In [16]:
inputs.Age = inputs.Age.fillna(inputs.Age.mean())
inputs.head(5)

   Pclass   Age     Fare  female  male
0       3  34.5   7.8292       0     1
1       3  47.0   7.0000       1     0
2       2  62.0   9.6875       0     1
3       3  27.0   8.6625       0     1
4       3  22.0  12.2875       1     0

In [18]:
inputs.Fare = inputs.Fare.fillna(inputs.Fare.mean())
inputs.head(5)

   Pclass   Age     Fare  female  male
0       3  34.5   7.8292       0     1
1       3  47.0   7.0000       1     0
2       2  62.0   9.6875       0     1
3       3  27.0   8.6625       0     1
4       3  22.0  12.2875       1     0

In [19]:
inputs.columns[inputs.isna().any()]

Index([], dtype='object')

In [36]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(inputs, target, test_size=0.2)

In [28]:
len(X_train)

334

In [29]:
len(X_test)

84

In [30]:
len(inputs)

418

In [31]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [37]:
model.fit(X_train,y_train)

GaussianNB()

In [38]:
model.score(X_test,y_test)

1.0

In [39]:
X_test[:10]

     Pclass       Age      Fare  female  male
78        2  30.00000   13.0000       0     1
132       3  30.27259   25.4667       1     0
63        3  22.00000    7.7250       1     0
253       3  24.00000    9.3250       0     1
129       3  24.00000    8.0500       0     1
371       1  31.00000  134.5000       1     0
61        2  32.00000   13.5000       0     1
190       2  34.00000   26.0000       0     1
247       2  42.00000   32.5000       0     1
80        3   6.00000   15.2458       0     1

In [40]:
y_test[:10]

78     0
132    1
63     1
253    0
129    0
371    1
61     0
190    0
247    0
80     0
Name: Survived, dtype: int64

In [41]:
model.predict(X_test[:10])

array([0, 1, 1, 0, 0, 1, 0, 0, 0, 0], dtype=int64)

In [42]:
model.predict_proba(X_test[:10])

array([[1., 0.],
       [0., 1.],
       [0., 1.],
       [1., 0.],
       [1., 0.],
       [0., 1.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.]])